# 1 事前準備

ハンズオンを開始する前に前提知識、ハンズオン環境を確認ください。これらが満たされない場合、一部または全部のハンズオンが実施できない場合があります。

## 1.1 前提知識

次の知識(スキル)が当ハンズオンの前提となります。

* 下記に例示したIBM iの基本スキルを有する
  * 5250画面の操作
  * 基本CLコマンドの実行
  * PDMとSEUを使用したソースの編集とコンパイル
  * IFSの操作
  * Access Client Solutionの5250画面セッションの構成、SQLスクリプト実行
  * WindowsからIBM i へのFTP、オンライン保管ファイルを使用した復元
  * NetServer共有設定
  * Windowsのコマンドプロンプト、ソフトウェアのインストールなどの基本操作ができる

* 下記の知識(スキル)があれば、ハンズオンをスムースに実施し、内容をより深く理解できるでしょう。
  * YouTube動画「IBM iでWebサービス 概要編」([https://youtu.be/RUOfH6U5tRk](https://youtu.be/RUOfH6U5tRk){:target="_blank"}{:rel="noopener noreferrer"})を視聴済み
  * ILE-RPGのAPI/モジュールプログラミング
  * 文字コード (EBCDIC/ユニコード、CCSID)、各種エンコード方法
  * AIXやLinuxなど、UNIX系オペレーティングシステムに関する、基本概念(コマンド、パス、標準入出力、パーミッションなど)、PythonおよびNode.js(基本文法、実行環境、拡張モジュール)、DBアクセス(SQL、ODBC)の知識を有する
  * HTTPの基本的な動作(GET/POSTなどのメソッド、環境変数など)
  * HTTPサーバー(Apache)の基本知識

<br>

## 1.2 ハンズオン環境

ハンズオンでは個々の参加者にPCを持参ください。また、ハンズオンに使用するIBM iを個別に用意する場合、下記要件が前提となります。

<u>**IBM iの要件**</u>

* IBM iのバージョンが7.4以降(7.3以前は非推奨)。QSYS2のSQL HTTP機能を使用する場合はIBM i 7.3 TR11/IBM i 7.4 TR4以降
* 5770SS1 Opt-30 Qshell、5770SS1 Opt-33 Portable Application Solution Environment (PASE)、5770SS1 Opt-34 デジタル証明書マネージャー、5733SC1 IBM Portable Utilities for i (Opt-1 OpenSSH, OpenSSL, zlibを含む)、5770DG1 IBM HTTP Server for iがインストールされており、使用可能
* Webブラウザから「http://(IBM iのIPアドレスまたはホスト名):2001/HTTPAdmin」にアクセスして「IBM Web Administration for i」画面が表示されて操作が可能
* IBM iにOSS(rpm)がインストール済み (1.2.1参照) 
* IBM iでsshサーバーが起動されており、sshクライアントからアクセスできる (1.2.3参照) 
* ACSの5250でアクセスし、高権限ユーザー(QSECOFR)でサインオンできる
* 高権限ユーザーで、ユーザーの作成、ライブラリーの復元、IFSストリームファイルの復元、が許可されている
* PCからNetServerまたはFTPでIBM iの任意のフォルダーにアクセスが可能
* CLやRPGコンパイラーなど一般的なライセンス・プログラムが利用できる

<u>**クライアントPCの要件**</u>

* 最新のWindows10を搭載したPCを持参
* 持参PCで最新のIBM Access Client Solutions (以下ACS)が動作する事
* 持参PCでsshクライアントが動作する事 (1.2.2参照)
* 持参PCからインターネットにアクセスできる
* 自社・自組織のIBM i に接続できる

当ハンズオン資料にOSS実行環境構築の解説は含まれません。実施に当たってはあらかじめ環境を構築し、前提となる要件を満たしている必要があります。

<br>

### 1.2.1 IBM iへのOSSインストール

ハンズオンで使用するIBM iにOSSが未導入の場合、「IBM i OSS Docs」(https://ibmi-oss-docs.readthedocs.io/en/latest/README.html 英語)の「Getting Started」→「Installation」などを参照してOSSをインストールします。

?> ライセンス・プログラム 5733-OPS(IBM i Open Source Solutions)は2019年末にサポートが終了しており、当ハンズオンでは使用しません。

<font size="-2">
※	OSSがすでにインストール済み、あるいは、共有ハンズオン・サーバーを利用する場合はこのステップは不要です。
</font>

<p>　</p>

IBM iがインターネットにアクセスできる場合はACSの「オープン・ソース・パッケージ管理」を利用すると簡単でしょう。大まかな手順は次のようになります。

?> 「Getting started with Open Source Package Management in IBM i ACS」(https://www.ibm.com/support/pages/getting-started-open-source-package-management-ibm-i-acs 英語)に手順の記載有り。

①	ACSのメイン画面から「オープン・ソース・パッケージ管理」を起動
  * ACSは最新版の利用を推奨。エラーが発生する場合は「IBM i OSS Docs」の「Troubleshooting Yum connection problems」などを参照

②	「SSHに接続」ウインドゥで、「システム」「ユーザー名」「パスワード」を入力、「SSH鍵」を使用しない場合はチェックを外して「OK」をクリック
  * ログインに失敗する場合はユーザーID/パスワードが正しいこと、IBM iでsshサーバーが起動している事を確認

  ?> sshサーバーの起動確認方法は、後述の「ハンズオン手順□W1-2」を参照。

  * ユーザーはCCSID 5035または1399を指定して作成。ユーザーIDの長さは8文字まで(POSIX標準の制約)

③	「オープン・ソース・パッケージ管理」ウインドゥにインストール済みRPMの一覧が表示される。「使用可能なパッケージ」タブをクリックし、インストールするRPMを選択して「インストール」をクリック

?> 「rpmdb open failed」エラーが発生した場合は「$ rpm --rebuilddb」で復旧するケース有り。

  * 必要なパッケージ(RPM)の判別が難しい場合は、全てのパッケージのインストールを推奨。2022/10時点で、全パッケージをインストール後のディレクトリー「/QOpenSys/pkgs/」のディスク使用量は10GB程度

④	「使用可能なパッケージ」のインストールが完了したら、「使用可能な更新」タブを表示し、更新するRPMを選択して「アップグレード」をクリック

⑤	「使用可能なパッケージ」および「使用可能な更新」にインストール対象のパッケージが無くなるか、あるいは「Package Installation」の黒画面で「Nothing to do」と表示されるまで繰り返す

<br>

OSSのインストールに要する時間は回線速度やIBM iの能力などにより変動します。すべてのパッケージのインストールの場合、半日は確保する事をお勧めします。

![1.2.1_IBM_i_へのOSSインストール.jpg](/files/1.2.1_IBM_i_へのOSSインストール.jpg)

<br>

### 1.2.2 sshクライアントのセットアップ

このハンズオンではWindows10標準(2018年秋のアップデートで追加)のsshコマンドを使用します。Windowsの「設定」→「アプリ」→「オプション機能の管理」から「OpenSSH クライアント」をインストールします。

?> PuTTYやTeraTermなど歴史のあるsshクライアントを使い慣れている場合は、そちらでもハンズオンに支障はありません。

![1.2.2_sshクライアントのセットアップ.jpg](/files/1.2.2_sshクライアントのセットアップ.jpg)

インストール済みの場合は、コマンド・プロンプトで「ssh⏎」と打鍵するとヘルプが表示されます。

```bash
C:\Users\(Windowsのユーザー名)>ssh
usage: ssh [-46AaCfGgKkMNnqsTtVvXxYy] [-B bind_interface]
           [-b bind_address] [-c cipher_spec] [-D [bind_address:]port]
           [-E log_file] [-e escape_char] [-F configfile] [-I pkcs11]
           [-i identity_file] [-J [user@]host[:port]] [-L address]
           [-l login_name] [-m mac_spec] [-O ctl_cmd] [-o option] [-p port]
           [-Q query_option] [-R address] [-S ctl_path] [-W host:port]
           [-w local_tun[:remote_tun]] destination [command]
```

<br> 

### (参考) sshクライアント

IBM iのPASE環境への接続には、IPホスト同士が通信するためのプロトコルの一つであるSSH(Secure Shell)が利用できます。見かけはtelnet端末に似ていますが、SSHでは認証部分を含めたネットワーク上の通信がすべて暗号化されます。

IBM iがSSHサーバーの場合、「STRTCPSVR SERVER(*SSHD)」でSSHサーバーを起動し、任意のSSHクライアントから接続して利用します。

?> 標準でSSHサーバはTCPの22番ポートでクライアントの接続を待機するので、コマンド「NETSTAT OPTION(\*CNN)」で確認できる。IPL時にsshdを自動起動するには、コマンド「CHGTCPSVR SVRSPCVAL(\*SSHD) AUTOSTART(*YES)」を実行。

Windows 10標準のsshクライアントを利用するには、コマンドプロンプトを開いて「ssh ユーザー名@ホスト名」でSSHサーバーに接続します。問題が発生した場合、高度な接続方法などは下記を参照ください。

* sshコマンドが見つからない、正しくない → 「Windowsの設定」→「アプリ」→「アプリと機能 – オプション機能」で、OpenSSHクライアントがインストール済みであることを確認
* その他、パスワード無しでログインする方法など → クライアントの設定はインターネット上のOpenSSH関連情報を参照。ホスト(IBM i側)のssh/sshd設定はIFSディレクトリーの /QOpenSys/QIBM/UserData/SC1/OpenSSH/etc (IBM i 7.2以降)にあるので、必要に応じて参照／更新

?> OpenSSH関連情報は、「Setting up a User’s Environment」(https://ibmi-oss-docs.readthedocs.io/en/latest/user_setup/README.html )や「HOW TO CONFIGURE AND USE SSH ON IBM i」(https://www.seidengroup.com/php-documentation/how-to-configure-and-use-ssh-on-ibm-i/ )など。

<br>

### 1.2.3 ハンズオン用ユーザーの作成と環境設定

ユーザーはIBM i側(5250画面)から作成します。ホスト・コード・ページを5035または1399に設定した5250画面セッションを起動して以降の手順を実施します。

<br>

**1) ユーザー・プロフィールの作成**

UNIXでは英小文字を多用するので、ユーザー・プロフィールのCCSIDに5035(日本ローマ字/漢字)または1399(日本 ユーロ対応)を指定します。

```
> CRTUSRPRF USRPRF(WEBSxx) PASSWORD() USRCLS(*PGMR) INLPGM(QCMD) INLMNU(*SI
  GNOFF) CCSID(5035) 
  *NONE 特殊権限が認可さた。 
   ユーザー・プロファイル WEBSXX が作成された。 
```

<font size="-2">
※	USRPRFパラメーターの「xx」は共有ハンズオン・サーバーを利用するときはインストラクターのガイドに従って設定してください。
<br>
※ PASSWORDパラメーターのデフォルトは、7.4以前は\*USRPRF(ユーザー名と同じ)ですが、7.5では*NONEに変更されています。
</font>

<p>　</p>

**2) シェル環境の設定**

作成したユーザープロフィール「WEBSxx」で5250画面にサインオンします。

ホームディレクトリ(通常は「/home/ユーザー名」)を作成し、シェルスクリプト「.profile」と「.bashrc」を作成してログイン時の環境を設定します。EDTFコマンドでシェルスクリプトにログイン処理を入力します (__EDTF画面の「F15= 保守」でCCSIDが1208(UTF-8)を確認し、選択項目「5」で改行を「*LF」に変更__)。最後にchmodコマンドでスクリプトに実行権限を付与します。

```
> MKDIR DIR('/home/WEBSXX')                        
   ディレクトリーが作成された。                    
> QSH CMD('touch -C 1208 /home/WEBSXX/.profile')   
   コマンドは終了状況 0 で正常に終了しました。     
> QSH CMD('touch -C 1208 /home/WEBSXX/.bashrc')    
   コマンドは終了状況 0 で正常に終了しました。     
> EDTF STMF('/home/WEBSXX/.profile')   

CMD ....+....1....+....2....+....3....+....4....+....5
     ************* データの始め ****************      
    exec bash                                 ←ログイン時にbashシェルを起動
     *********** データの終わり ******************    

> EDTF STMF('/home/WEBSXX/.bashrc')

CMD ....+....1....+....2....+....3....+....4....+..
     ************* データの始め ****************   
    export PATH=/QOpenSys/pkgs/bin:$PATH      ←OSSへのパスを追加
    export LANG=JA_JP.UTF-8                   ←言語設定を日本語UTF-8に指定
     *********** データの終わり ******************

> QSH CMD('chmod 755 /home/WEBSXX/.profile')  ←スクリプトに実行権限を付与
   コマンドは終了状況 0 で正常に終了しました。 
> QSH CMD('chmod 755 /home/WEBSXX/.bashrc')     
   コマンドは終了状況 0 で正常に終了しました。
```

<br>

**3) sshでIBM i (PASE環境)にログイン**

Windowsのコマンドプロンプトを起動し、「ssh ユーザー名@サーバー名(またはIPアドレス)」でIBM iのsshサーバーにログインします。正常にログイン出来たら現行ディレクトリー、ホームディレクトリに存在するファイル、環境設定を表示・確認します。

```
C:\Users\(Windowsユーザー名)>ssh websxx@ibmi
websxx@ibmi's password: (パスワードを入力)
bash-5.1$ pwd
/home/WEBSXX                              ←現行ディレクトリー
bash-5.1$ ls –l
total 32                                  ←ホームディレクトリーのファイル
drwxrwsrwx  2 websxx 0 8192 Mar  6 10:48 .
drwxrwsrwx 12 qsys   0 8192 Mar  6 10:45 ..
-rwxr-xr-x  1 websxx 0   61 Mar  6 10:56 .bashrc
-rwxr-xr-x  1 websxx 0   10 Mar  6 10:53 .profile
bash-5.1$ set
BASH=/usr/bin/bash                        ←環境設定
～～～～～～～～～～～～～～～ 中略 ～～～～～～～～～～～～～～～～～
LANG=JA_JP.UTF-8
～～～～～～～～～～～～～～～ 中略 ～～～～～～～～～～～～～～～～～
PATH=/QOpenSys/pkgs/bin:/QOpenSys/usr/bin:/usr/ccs/bin:/QOpenSys/usr/bin/X11:/usr/sbin:.:/usr/bin
～～～～～～～～～～～～～～～ 中略 ～～～～～～～～～～～～～～～～～
USER=websxx
_=-la
bash-5.1$
```

* sshで初めてホストにログインする際に警告メッセージが表示されるので、このハンズオンでは「yes」で応答して再度ログインしてください。

```
C:\Users\(Windowsユーザー名)> ssh webwxx@ibmi
The authenticity of host 'XXX (xx.xx.xx.xx)' can't be established.
ECDSA key fingerprint is SHA256:aX48KBsokHduGRHYrw3eRn0rwe47MAygcyv8Jif/Qxw.
Are you sure you want to continue connecting (yes/no/[fingerprint])? yes
Warning: Permanently added 'idemo' (ECDSA) to the list of known hosts.
Connection closed by xx.xx.xx.xx port 22

C:\Users\(Windowsユーザー名)>
```

* IBM iのsshサーバーが起動していない状態でクライアントが接続を試みると、「ssh: connect to host XXX port 22: Connection refused」とエラーになるので、5250画面からコマンド「STRTCPSVR SERVER(*SSHD)」でsshdを起動します。

```
> STRTCPSVR SERVER(*SSHD)          
  SSHD サーバーは開始中である。   
```

* sshdが正常に起動すると、サブシステムQUSRWRK内のジョブQP0ZSPWP(機能「PGM-sshd」)が常駐し、ポート22でssh接続を待機している事をNETSTAT OPTION(*CNN)で確認できます。

* sshdが起動しているにも関わらずsshでログインできない場合は、pingでIBM iと疎通が取れるか、ユーザーIDがIBM iに存在するか、Firewallなどで通信が制限されていないか、などを確認します。

<br>

## 1.3 設定情報

|設定項目|設定値|個別の設定|
|-------|-----|----------|
|IBM i サーバーIPアドレス|IPアドレスまたはホスト名||
|ユーザーID|WEBSxx (xxは実施時に確認)||
|パスワード|WEBSxx (xxは実施時に確認)||
|ハンズオン用ライブラリー|WEBSxxLIB (xxは実施時に確認)||
|ハンズオン用ディレクトリー|/home/WEBSxx (xxは実施時に確認)||
|ACS 5250セッション2|ﾎｽﾄ･ｺｰﾄﾞ･ﾍﾟｰｼﾞ1399<br>(Latin Unicode 拡張 JIS2004)<br>画面サイズ 27x132||

?> PCにIBM i のホスト名を登録すると効率よくハンズオンを進められます。例えばWindows10では「C:\Windows\System32\drivers\etc\hosts」を管理者権限で開き、末尾に下記の要領でIPアドレスと任意のホスト名を追加すれば、192.168.1.123のホスト(IBM i )に「ibmi」でアクセスできます。
```
～～～～～～前略～～～～～～～
#	::1             localhost
192.168.1.123		ibmi
```

<br>

---

### <u>ワーク1：ハンズオン環境の準備</u>

**ssh動作の確認。**

**□ W1-1.** 5250端末から高権限ユーザーでIBM iにサインオンし、コマンド入力画面を表示。

**□ W1-2.** IBM iでsshサーバーが起動している事を確認。

```
> WRKACTJOB SBS(QUSRWRK)

                                活動ジョブ処理                         XXXXXXX  
                                                         22/XX/XX  XX:XX:XX JST 
 CPU %:     2.4     経過時間 :   00:02:48     活動ジョブ :   178                
                                                                                
 オプションを入力して，実行キーを押してください。                               
   2= 変更   3= 保留     4= 終了   5= 処理   6= 解放   7= メッセージ表示        
   8=ｽﾌﾟｰﾙ･ﾌｧｲﾙ の処理   13= 切断 ...                                           
                      現行                                                      
 OPT  ｻﾌﾞｼｽﾃﾑ/ｼﾞｮﾌﾞ   ﾕｰｻﾞｰ      ﾀｲﾌﾟ  CPU %   機能            状況             
      QUSRWRK        QSYS        SBS      .0                   DEQW             
        QCTXDMON     QSECOFR     BCI      .0  PGM-ictt_daemo   TIMW             
        QCTXMGR      QSECOFR     BCH      .0                   SELW             
        QP0ZSPWP     QSECOFR     BCI      .0  PGM-sshd         SELW             
```

```
> NETSTAT OPTION(*CNN)

                              IPV4 接続状況の処理                             
                                                          システム :   XXXXXXX
 オプションを入力して，実行キーを押してください。                             
   3= デバッグ使用可能   4= 終了   5= 詳細の表示   6= デバッグ使用不可        
   8= ジョブの表示                                                            
                                                                              
      ﾘﾓｰﾄ             ﾘﾓｰﾄ       ﾛｰｶﾙ           ｱｲﾄﾞﾙ                        
 OPT  ｱﾄﾞﾚｽ            ﾎﾟｰﾄ       ﾎﾟｰﾄ           時間    状態                 
      *                *          ftp-con >  096:13:23   接続待機             
      *                *          ssh        100:20:06   接続待機             
```

**□ W1-3.**  (sshサーバーが起動していない場合) sshサーバーを起動。再度W1-2の手順で起動を確認。

```
> STRTCPSVR SERVER(*SSHD)          
  SSHD サーバーは開始中である。    
```

**□ W1-4.** PASEシェルでインストール済みのrpm数を表示。すべてのパッケージをインストールした場合は下図に近い値かを確認。

```
> CHGJOB CCSID(5035)
> CALL PGM(QP2TERM)

                            /QOpenSys/usr/bin/-sh  
                                                   
  #                                                 
> export PATH=/QOpenSys/pkgs/bin:$PATH              
  #                                                 
> rpm -qa | wc -l                  ←インストール済みrpm総数
  578                             
  #                               
> rpm -qa | grep -i python | wc -l ←インストール済みrpmで「python」を含む数
  85                                 ｢grep: python: このパス名...」エラーに
  #                                  なる場合は｢-i｣を｢--ignore-case｣に変更
```

**□ W1-5.** WindowsのsshクライアントからIBM iにログイン。

**□ W1-6.** ディレクトリー「/home」下に自身のホームディレクトリ「WEBSxx」が存在し、ログインスクリプトが存在する事を確認。

**□ W1-7.** ログイン時にハンズオン用の環境が設定されているか「set」コマンドで確認。

* シェルがbashに設定されている
* 下記のように環境変数が設定されている
  * 環境変数「PATH」の先頭に「/QOpenSys/pkgs/bin」が存在
  * 環境変数「LANG」が「JA_JP.UTF-8」である

<br>

**サンプルファイルの取得、ソース/DBファイルのIBM iへの転送。**

**□ W1-8.** 指定のURLにアクセスして「WEBS.zip」を任意のフォルダーにダウンロード。Windowsのデスクトップにハンズオン用フォルダー「WEBS」を作成し、「WEBS.zip」内の下記13ファイルをこのフォルダーに解凍。

|ファイル名|内容|サイズ|
|---------|----|------|
|.bashrc|bashシェルが起動時に読み込む設定ファイル|1KB|
|.profile|BourneシェルまたはKorn シェルがログインシェルの場合に実行されるファイル|1KB|
|3 CGI (ILE-RPG) - httpd.conf|「4.3 ③ CGI (ILE-RPG)」で使用するhttp構成ファイル|1KB|
|4 PASE CGI (Python) - httpd.conf|「4.4 ④ PASE CGI (Python)」で使用するhttp構成ファイル|1KB|
|5 PASE WSGI (Python) - fastcgi.conf|「4.5 ⑤ PASE WSGI (Python)」で使用するFastCGI(WSGI)サーバー構成ファイル|1KB|
|5 PASE WSGI (Python) - httpd.conf|「4.5 ⑤ PASE WSGI (Python)」で使用するhttp構成ファイル|1KB|
|fastcgi.py|Python WSGIスクリプト|2KB|
|GetWebService.html|「天気情報」を取得するHTMLファイル|1KB|
|json2csv.py|JSON形式ファイルをCSVファイルに変換する汎用Pythonスクリプト|1KB|
|personQry.js|Node.jsスクリプト (Webサービス・サー バー)|2KB|
|startREST.sh|シェルスクリプト (Node.jsスクリプトを起動)|1KB|
|testPackage.js|expressとodbc動作確認用Node.jsスクリプト|1KB|
|webssavf.savf|ソース物理ファイル「SOURCE」およびサンプルファイル「PERSON」「PERSONL1」|156KB|

**□ W1-9.** ハンズオン用ライブラリー「WEBSxxLIB」を作成。

```
> CRTLIB LIB(WEBSxxLIB) TYPE(*TEST)          
   ライブラリー WEBSxxLIB が作成された。     
```

**□ W1-10.** WindowsからFTPクライアントを起動し、IBM i へオンライン保管ファイルイメージ「webssavf.savf」を転送。オンライン保管ファイルの名前(例では「QGPL/WEBSxx」は既存以外の任意のファイル名。

```
C:\Users\(Windowsのユーザー名)\Desktop>ftp ibmi
ibmi に接続しました。
220-QTCP AT XXXXXX.CO.JP.
220 CONNECTION WILL CLOSE IF IDLE MORE THAN 5 MINUTES.
501 OPTS UNSUCCESSFUL; SPECIFIED SUBCOMMAND NOT RECOGNIZED.
ユーザー (ibmi:(none)): (IBM i のユーザー名)
331 ENTER PASSWORD. 
パスワード:(IBM i のパスワード)
230 XXXXX LOGGED ON.
ftp> bi
200 REPRESENTATION TYPE IS BINARY IMAGE.
ftp> QUOTE RCMD CRTSAVF QGPL/WEBSxx
250 COMMAND CRTSAVF QGPL/WEBSXX SUCCESSFUL.
ftp> put webssavf.savf QGPL/WEBSxx
200 PORT SUBCOMMAND REQUEST SUCCESSFUL.
150 SENDING FILE TO MEMBER WEBSxx IN FILE WEBSxx IN LIBRARY QGPL.
226 FILE TRANSFER COMPLETED SUCCESSFULLY.
ftp: 201168 バイトが送信されました 0.07秒 3048.00KB/秒。
ftp> quit
221 QUIT SUBCOMMAND RECEIVED.
```

**□ W1-11.** IBM i にサインオンしてマンド入力画面を表示し、ライブラリー「WEBSxxLIB」を復元。(「xx」は「1.3 設定情報」を参照)

```
> RSTLIB SAVLIB(WEBSXXLIB) DEV(*SAVF) SAVF(QGPL/WEBSxx) RSTLIB(WEBSxxLIB)
  3 個のオブジェクトを WEBSXXLIB から WEBSxxLIB へ復元した。  
```

**□ W1-12.** ソースファイル「WEBSxxLIB/SOURCE」に下記9メンバーが存在する事を確認。

```
ﾒﾝﾊﾞｰ       ﾀｲﾌﾟ        ﾃｷｽﾄ                                            
IWSSVRRPG   RPGLE       Web サービス - 登録者マスター照会 (IWS) サーバー
JKS2KDB     CLLE        Java の cacerts キーストアを IBM KDB 形式に変換 
PERSON      PF           登録者一覧                                     
PERSONL1    LF           登録者一覧 - KEY: 姓名（読み）                 
WEATHERCLP  CLP         Web サービスクライアント (CLP/curl/jq)          
WEATHERRPG  SQLRPGLE    Web サービスクライアント (ILE-RPG/SQL HTTP API) 
WSCGI       RPGLE       Web サービス - 登録者マスター照会 (CGI) サーバー
WSCSAMPLE1  CLP         Web サービス・クライアント例 (CLP/curl/Python)  
WSCSAMPLE2  CLP         Web サービス・クライアント例 (CLP/curl/SQL)
```

**□ W1-13.** IBM i の作業用ファイル「QGPL/WEBSxx」をDLTFコマンドで削除。

**□ W1-14.** WindowsデスクトップWEBS.zip、および、ハンズオン用フォルダー「WEBS」内のwebssavf.savfを削除。他のファイルはハンズオン中に適宜参照し、ハンズオン後に不要であれば削除。

<br>

**Web機能の動作確認**

**□ W1-15.** Webブラウザから「http://(IBMのホスト名またはIPアドレス):2001/HTTPAdmin」にアクセスし、QSECOFR(または特殊権限ALLOBJとIOSYSCFGを所有するユーザー)でログインし、「IBM Web Administration for i」が表示される事を確認。

![ワーク1_ハンズオン環境の確認.jpg](/files/ワーク1_ハンズオン環境の確認.jpg)

**□ W1-16.** (オプション) Webブラウザから「http://(IBMのホスト名またはIPアドレス):2006/dcm」にアクセスして高権限ユーザー(QSECOFRなど)でログインし、DCM画面が表示される事を確認。

![ワーク1_ハンズオン環境の確認2.jpg](/files/ワーク1_ハンズオン環境の確認2.jpg)

